// notices.js - 放置在js目录下
const noticeConfig = {
  notices: [
    {
      title: "改版后使用提示说明",
      content: "【点击中间】常用选项可调用其他搜索源，新增夜间模式提供3中方式默认为自动可自行调整设置并在本地保存使用习惯"
    },
    {
      title: "壁纸模块使用提示",
      content: "最多可本地添加6张自定义壁纸，点击缩略图即可切换或删除"
    },
    {
      title: "隐私说明",
      content: "所有壁纸设置数据仅存储在本地浏览器中，不会上传至服务器"
    },
    {
      title: "版权说明",
      content: "此项目中部分模块来自网络，部分模块通过ai大模型生成，导航数据来自网络，搜索模块中接口均来自网络搜索资源来自对应接口，仅供个人学习使用非商用如有侵权可在联系下方模块用户中心的邮箱删除。"
    }
  ]
};
